spec/fixtures/quaderno_cassettes/new_checkout_session.yml

---
http_interactions:
- request:
    method: post
    uri: http://sk_test_bMz9mJJ5bZnWPwWGuV8y:@quaderno.lvh.me:3000/api/checkout/sessions.json
    body:
      encoding: UTF-8
      string: '{"billing_details_collection":"auto","cancel_url":"http://example.com/cancel","success_url":"http://example.com/success","coupon_collection":true,"items":[{"product":"000000"}]}'
    headers:
      User-Agent:
      - Quaderno Ruby Gem 1.17.1
      Accept:
      - application/json
      Content-Type:
      - application/json
  response:
    status:
      code: 201
      message: Created
    headers:
      X-Frame-Options:
      - ALLOWALL
      X-Ratelimit-Limit:
      - '2000'
      X-Ratelimit-Reset:
      - '14'
      X-Ratelimit-Remaining:
      - '96'
      Content-Type:
      - application/json; charset=utf-8
      Vary:
      - Origin
      Etag:
      - W/"021d172f9f3c4ded0ff230685ed49028"
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - fde4a026-cd23-4554-bc3e-cd310208e9cb
      X-Runtime:
      - '0.180317'
      Connection:
      - close
      Server:
      - thin
    body:
      encoding: UTF-8
      string: '{"id":28,"status":"pending","billing_details_collection":"auto","cancel_url":"http://example.com/cancel","coupon_collection":true,"locale":"auto","payment_methods":["card"],"success_url":"http://example.com/success","custom":{},"metadata":{},"items":[{"product":"000000","amount":2100.0,"name":"Test_Skynet","description":null,"currency":"EUR","quantity":1}],"customer":{"billing_city":null,"billing_country":null,"billing_postal_code":null,"billing_street_line_1":null,"billing_street_line_2":null,"company":null,"email":null,"first_name":null,"last_name":null,"tax_id":null,"business_number":null},"permalink":"http://quaderno.lvh.me:3000/checkout/session/50f3a4794083463d8ddd8dfc43e26640691d81f4"}'
    http_version: 
  recorded_at: Tue, 17 Sep 2019 11:14:49 GMT
- request:
    method: delete
    uri: http://sk_test_bMz9mJJ5bZnWPwWGuV8y:@quaderno.lvh.me:3000/api/checkout/sessions/28.json
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
  response:
    status:
      code: 204
      message: No Content
    headers:
      X-Frame-Options:
      - ALLOWALL
      X-Ratelimit-Limit:
      - '2000'
      X-Ratelimit-Reset:
      - '13'
      X-Ratelimit-Remaining:
      - '95'
      Vary:
      - Origin
      Cache-Control:
      - no-cache
      X-Request-Id:
      - a1672b77-df14-4d09-ad52-71353631a2c1
      X-Runtime:
      - '0.116559'
      Connection:
      - close
      Server:
      - thin
    body:
      encoding: UTF-8
      string: ''
    http_version: 
  recorded_at: Tue, 17 Sep 2019 11:14:49 GMT
recorded_with: VCR 5.0.0
